hunt/baseCase/basecase_mhdEpotMultiRegionFoam_Ha20_strongScaling_80k_20k/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           FPCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.05;
    }

    pFinal
    {
        $p;
        relTol           0;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    UFinal
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
    
    PotE
    {
        solver           FPCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.05;
    }
    
    PotEFinal
    {
        $PotE;
        relTol           0;  
    }    
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
